{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "hindi",
    "1": "english",
    "10": "tamil",
    "11": "telugu",
    "2": "gujarati",
    "3": "punjabi",
    "4": "assamese",
    "5": "bengali",
    "6": "kannada",
    "7": "malayalam",
    "8": "marathi",
    "9": "odia"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "assamese": "4",
    "bengali": "5",
    "english": "1",
    "gujarati": "2",
    "hindi": "0",
    "kannada": "6",
    "malayalam": "7",
    "marathi": "8",
    "odia": "9",
    "punjabi": "3",
    "tamil": "10",
    "telugu": "11"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.48.1"
}
